; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite2 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph4 - mode
	infrared2 - mode
	image1 - mode
	spectrograph0 - mode
	image3 - mode
	GroundStation0 - direction
	Star2 - direction
	Star10 - direction
	Star6 - direction
	Star1 - direction
	Star5 - direction
	Star4 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	GroundStation11 - direction
	Star9 - direction
	GroundStation7 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 Star6)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image3)
	(calibration_target instrument2 Star4)
	(supports instrument3 image1)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon16)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation11)
	(supports instrument5 image1)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 Star4)
	(supports instrument6 infrared2)
	(supports instrument6 image3)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
	(supports instrument7 infrared2)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 GroundStation11)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation7)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite2 Star5)
	(have_image Phenomenon12 image3)
	(have_image Star13 image3)
	(have_image Star14 spectrograph4)
	(have_image Planet15 image3)
	(have_image Phenomenon16 spectrograph4)
))

)

; plan
1. (turn_to satellite1 groundstation3 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 6
2. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 0 of 6
3. (calibrate satellite1 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon12 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon12)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation3 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 6
6. (take_image satellite1 phenomenon12 instrument6 image3)
   added: (have_image phenomenon12 image3)
   goals met: 1 of 6
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
8. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 6
9. (turn_to satellite0 phenomenon16 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 6
10. (take_image satellite0 phenomenon16 instrument1 spectrograph4)
   added: (have_image phenomenon16 spectrograph4)
   goals met: 2 of 6
11. (turn_to satellite0 star14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star14)
   goals met: 2 of 6
12. (take_image satellite0 star14 instrument1 spectrograph4)
   added: (have_image star14 spectrograph4)
   goals met: 3 of 6
13. (turn_to satellite1 planet15 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet15)
   goals met: 3 of 6
14. (take_image satellite1 planet15 instrument6 image3)
   added: (have_image planet15 image3)
   goals met: 4 of 6
15. (turn_to satellite1 star13 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star13)
   goals met: 4 of 6
16. (take_image satellite1 star13 instrument6 image3)
   added: (have_image star13 image3)
   goals met: 5 of 6
17. (turn_to satellite2 star5 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 star5)
   goals met: 6 of 6
